{
  // 页面title
  title: "I'm Match_liu",
  // 社交链接
  social: {
    github: "https://github.com/ZhiyuL1u",
    linkedin: "https://www.linkedin.com/in/zhiyu-liu-515208281/",
  },
  // banner页
  banner: {
    anchor: {
      id: "banner",
      icon: "home",
      name: "Home",
    },
    title: "Hi, I'm ",
    secondTitle: "Match",
    desc: [
      "a grad student at UPenn",
      "studying in Computer Science",
      "also studying in Data Science",
      "looking for a job",
      "working on being a better me!!",
    ],
  },
  // 正文
  // 不要修改各模块的 anchor.id
  // 通过display控制模块是否展示
  // 通过列表顺序控制模块展示顺序
  modules: [
    // 关于页
    {
      display: true,
      anchor: {
        id: "about",
        icon: "user",
        name: "About"
      },
      header: {
        title: "information",
        subtitle: "about me",
      },
      content: {
        name: "Zhiyu Liu",
        desc: [
          "Studying in UPenn",
          "Major in Cs & Ds",
        ],
        md: "I am originally from China, now in USA\
        \nAs a dedicated coder, I aspire to make significant achievements in the field.I began with embedded systems, then moved on to study machine learning.\
        \nDespite not having a formal background in computer science, driven by sheer passion for development.\
        \nHaving studied for over five years and traveled between three cities across two domains, it has been an exhausting journey, but I find joy in it.",
      },
      // key - value 数量及内容完全自定义，链接自动识别
      keys: {
        "linkedin": "https://www.linkedin.com/in/zhiyu-liu-515208281/",
        "github": "https://github.com/ZhiyuL1u",
      },
    },
    // 履历
    {
      display: true,
      anchor: {
        id: "experience",
        icon: "idcard",
        name: "Experience"
      },
      header: {
        title: "experience",
        subtitle: "my experience",
      },
      cards: [
        {
          "title": "University of Pennsylvania",
          "subtitle": "September 2023 to Present",
          "md": "**<u>Graduate Student</u>**\
  \n\
  \n<!--**Major**: Systems Engineering-->\
  \n\
  \nThis program offers a wide selection of courses on machine learning, deep learning, and statistics.\
  \nI took courses related to databases, which were very helpful for my backend database development.\
  \nI continued to engage with various full-stack frameworks to expand my skill set"
        },



        {
          "title": "University of Nottingham Ningbo China",
          "subtitle": "September 2022 to September 2023",
          "md": "**<u>Undergraduate GPA (3.8/4)</u>**\
  \n\
  \n<!--**Major**: Machine Learning/Software Development-->\
  \n\
  \nAlthough my grades are good and I have a keen interest in embedded systems, I ventured into full-stack development and machine learning, dedicating myself to AI research.\
  \nBuilding on my existing knowledge of C and C++, I learned Java and Python, engaged with frameworks like YOLO, and began studying database technology.\
  \nOccasionally, I take on full-stack development projects, helping to create mini-programs for a fitness community and Oxford University, and assisting a local hospital with training CV models"
        },


        {
          title: "University of Nottingham Ningbo China",
          subtitle: "September 2019 to September 2022",
          md: "**<u>Undergraduate</u>**\
  \n\
  \n<!--**Major**: Electrical and Automation-->\
  \n\
  \nThe first semester focused on establishing a solid foundation in mathematics and physics, mastering linear algebra, matrices, and algorithms\
  \nIn the second year, I delved into circuit studies, familiarized with various development boards, and mastered various simulation software and coding skills\
  \nThe third year was mostly spent in the laboratory, completing various embedded projects, and designing and printing PCB boards",
        }

      ],
    },
    // 博客页



    {
      display: true,
      anchor: {
        id: "blog",
        icon: "profile",
        name: "Projects",
      },
      header: {
        title: "projects",
        subtitle: "My projects",
      },
      cards: [
        {
          keys: {
            "preview":"https://divebi.com",
            "github": "https://github.com/ZhiyuL1u/diveBi",
          },
          "title": "DiveBI(AIGC-based Business Intelligence platform)",
          "subtitle": "Tech Stack: Front-end(React, Ant Design Pro, Easy Excel) Back-end(Java, SpringBoot, MyBatisPlus,Thread Pool, RabbitMQ, Redisson RateLimiter) deployments(OpenAI API, MySQL, Redis, docker, nginx, Google cloud)",
          "img": "divebi.png",
          "md": "**<u>Description:</u>**\
  \n\
  \n\
  \nThis site uses the openai interface (the latest gpt4o) to cater for users uploading excel chart analyses.\
  \nDistributed Rate Limiting - Limit single-user access frequency to prevent malicious use of system resources.\
  \nAsynchronous - Implement asynchronous AIGC using a custom I/O-intensive thread pool and task queue.\
  \nDistributed Message Queue - Use RabbitMQ to receive and persist task messages, forwarding them through a Direct exchange to a decoupled AI generation module for task processing. \
          \nAdditionally, a dead-letter queue is created to handle tasks with AI Generation Error, enhancing system reliability."

        },
        {
          keys: {
            "preview":"https://pennguys.com",
            "preview(admin page)":"https://admin.pennguys.com",
            "github(FrontEnd only)": "https://github.com/ZhiyuL1u/myblog_frontend",
          },
          "title": "Pennguys: Knowledge Exchange Blog",
          "subtitle": "Tech Stack: Front-end(Js, vue, ElementUI ,EasyExcel, Echarts) Back-end(Java, SpringBoot, MyBatisPlus) deployments(MySQL, Redis, docker, nginx, Google cloud)",
          "img": "pennguys.png",
          "md": "**<u>Description:</u>**\
  \n\
  \n\
  \nThis website features two main interfaces: a blog display page and an admin management page (access requires approval).\
  \nThe primary function is to share problems encountered in my studies and daily life. The display page includes a complete login system and integrates Redis to update view counts in real-time.\
  \nEach blog post supports comments. Users also have their own user center where they can modify their attributes.\
  \nOn the management page, users can publish posts, save and modify them multiple times, and control user permissions.\
          \nThere are many valuable blogs on the site!"

        },
        {
          keys: {
            "github": "https://github.com/lyuanzhi/AllWhale?tab=readme-ov-file",
          },
          "title": "AllWhale",
          "subtitle": "Tech Stack: Front-end(Js Uni-app (based on vue)) Back-end(Java, SpringBoot, Maven, MyBatis, WebSocket, MySQL, Apache Tomcat)",
          "img": "allwhale.png",
          "md": "**<u>Description:</u>**\
  \n\
  \n\
  \nA WeChat mini program that combines on-campus forum, second-hand platform, and more. This project was completed in 2022.\
  \nWe decided to develop a WeChat Mini Program featured in on-campus online forum and second-hand trading platform, and named it AllWhale (originally oxcean).\
  \nThe reason for using WeChat Mini Program was that we wanted to popularize WeChat in Oxford.\
  \nThe WeChat Mini Program Account: ```AllWhaleLYZ```.\
  \nThe server IP address: ```34.41.117.214```"
        },
        {
          keys: {
            "preview Pdf":"https://drive.google.com/file/d/1paJ2T9YXG6vjIQYR-rI9u8RQcEx-QSe6/view",
            "github": "https://github.com/ZhiyuL1u/IMAGE-DESCRIPTION-AI-BRIDGING-VISION-AND-LANGUAGE-WITH-DEEP",
          },
          "title": "IMAGE-DESCRIPTION AI: BRIDGING VISION AND LANGUAGE WITH DEEP",
          "subtitle": "Research Interests: Machine Learning & Deep Learning, Convolutional Neural Networks(CNNs), NLP(Transformer), python ,pytorch",
          "img": "IMAGE-DESCRIPTION_AI.png",
          "md": "**<u>Description:</u>**\
  \n\
  \n\
  \nThis project aims to develop an AI system focused on interpreting images through the application of deep learning technologies, primarily Convolutional Neural Networks (CNNs) and Transformers.\
  \nThe aim is to create a tool capable of processing and describing visual information, which could have practical implications in several areas such as aiding the visually impaired,\
  \nimproving recommendation systems, and facilitating the integration of Computer Vision (CV) and Natural Language Processing (NLP). Initial results have shown promising performance,\
  \nwith the model vividly and accurately describing the contents of images in test datasets, which highlights the feasibility of deploying this method in practical applications.\
          \nProvide a pdf of the paper, and code that can be reproduced"

        },
        {
          keys: {
            "preview":"https://spotify-themed-web.zhiyuliu.com",
            "github": "https://github.com/ZhiyuL1u/Spotify-themed_web",
          },
          "title": "Spotify-themed-web",
          "subtitle": "Tech Stack: Front-end(Js, react) Back-end(Node.js) deployment(docker, Mysql, nginx, pm2, Google cloud)",
          "img": "spotify-themed-web.png",
          "md": "**<u>Description:</u>**\
  \n\
  \n\
  \nI built an interactive Spotify-themed web application using React and Node.js backed by a MySQL RDS database\
  \nThe site was connected to my AWS mysql database, which stored information about each of Taylor's songs and playlists.\
  \nI separated the back-end of the project and deployed it on different servers. The back-end used mp2 for continuous deployment of the node project\
  \nThe project realizes the functions of paging query and data analysis."

        },
        {
          keys: {
            "preview":"https://www.linkedin.com/in/zhiyu-liu-515208281/details/projects/",
          },
          "title": "Training Appropriate Dress Test for Healthcare Professionals",
          "subtitle": "Research Interests: Machine Learning & Deep Learning, Yolo v3, Python",
          "img": "health.png",
          "md": "**<u>Description:</u>**\
  \n\
  \n\
  \nA dataset of healthcare workers' clothing is collected and processed, and the corresponding model is trained using yolo.\
  \nThe model is used to assess the standard of dress and is commercially available in hospitals.Where due to the small sample, data enhancement was used to save on filming costs.\
  \nDue to the actual deployment environment limiting the yolo version, using a higher version can have better results.\
          \nCannot provide the code..."

        },
        {
          keys: {
            "pdf preview":"https://drive.google.com/file/d/18lyaep4CFfpEpIqj37xs1zzSgf7CGYGY/view?usp=sharing",
          },
          "title": "Indoor Position Using Ubisense Ultrasonic Sensors",
          "subtitle": "Research Interests: Machine Learning & Deep Learning, Reinforcement Learning",
          "img": "indoor.png",
          "md": "**<u>Description:</u>**\
  \n\
  \n\
  \nDeveloped a simulation environment for indoor positioning in Python, preliminarily verified relevant algorithms, and collected pertinent training data sets.\
  \nProposed intelligent indoor positioning algorithms to minimize positioning errors, detect NLOS, and save energy by disabling several sensors based on machine learning algorithms, i.e., LSTM neural networks, reinforcement learning, Double DQN, etc.\
          \nknow more to see the PDF"

        },
        {
          keys: {
          },
          "title": "Vehicle Autonomy: Image & Sign Recognition with Speed Monitoring",
          "subtitle": "Embedded (c/c++, Arduino, STM32, Raspberry) Simulation software (Matlab KiCad, PLECS, LTspice, ADS, Verilog)",
          "img": "vehicle.png",
          "md": "**<u>Description:</u>**\
  \n\
  \n\
  \nControlled the vehicle based on Raspberry Pi, implemented algorithms like PID to achieve automatic line following and developed an image recognition algorithm with OpenCV in c++.\
  \nEngineered and assembled vehicles using Raspberry Pi and Arduino platforms. Implemented algorithms such as PID and leveraged CNN models for automatic line following through various color and pixel processing techniques.\
          \nUtilized OpenCV to develop algorithms for real-time recognition of road signs and other images from camera stream. Integrated a pre-trained deep learning face recognition model, enabling the vehicle to identify various faces."

        }],
    },
  ],
}
